kab7/Flipper-Zero-ESP32-Port/components/furi_hal/furi_hal_power.c
typedef struct {
    bool initialized;
    bool init_attempted;
    bool adc_ready;
    bool adc_cali_ready;
    bool last_sample_ok;
    bool otg_enabled;
    bool has_battery_reading;
    uint8_t insomnia;
    uint8_t suppress_charge;
    int64_t last_sample_us;
    float charge_voltage_limit;
    float last_supply_voltage;
    float last_battery_voltage;
    adc_unit_t adc_unit;
    adc_channel_t adc_channel;
    adc_oneshot_unit_handle_t adc_handle;
    adc_cali_handle_t adc_cali_handle;
} FuriHalPowerState;

typedef struct {
    float voltage;
    uint8_t pct;
} FuriHalPowerCurvePoint;

static FuriHalPowerState furi_hal_power = {
    .initialized = false,
    .init_attempted = false,
    .adc_ready = false,
    .adc_cali_ready = false,
    .last_sample_ok = false,
    .otg_enabled = false,
    .has_battery_reading = false,
    .insomnia = 0,
    .suppress_charge = 0,
    .last_sample_us = 0,
    .charge_voltage_limit = FURI_HAL_POWER_FULL_BATTERY_VOLTAGE_V,
    .last_supply_voltage = 0.0f,
    .last_battery_voltage = FURI_HAL_POWER_FULL_BATTERY_VOLTAGE_V,
};

static const FuriHalPowerCurvePoint furi_hal_power_curve[] = {
    {3.27f, 0},
    {3.61f, 5},
    {3.69f, 10},
    {3.71f, 20},
    {3.73f, 30},
    {3.75f, 40},
    {3.77f, 50},
    {3.79f, 60},
    {3.82f, 70},
    {3.87f, 80},
    {3.94f, 90},
    {4.20f, 100},
};

static bool furi_hal_power_adc_calibration_init(
    adc_unit_t unit,
    adc_channel_t channel,
    adc_atten_t atten,
    adc_cali_handle_t* out_handle) {
#if ADC_CALI_SCHEME_CURVE_FITTING_SUPPORTED
    adc_cali_curve_fitting_config_t cali_config = {
        .unit_id = unit,
        .chan = channel,
        .atten = atten,
        .bitwidth = ADC_BITWIDTH_DEFAULT,
    };
    if(adc_cali_create_scheme_curve_fitting(&cali_config, out_handle) == ESP_OK) {
        return true;
    }
#endif
#if ADC_CALI_SCHEME_LINE_FITTING_SUPPORTED
    adc_cali_line_fitting_config_t cali_config = {
        .unit_id = unit,
        .atten = atten,
        .bitwidth = ADC_BITWIDTH_DEFAULT,
    };
    if(adc_cali_create_scheme_line_fitting(&cali_config, out_handle) == ESP_OK) {
        return true;
    }
#endif
    return false;
}

static float furi_hal_power_quantize_charge_limit(float voltage) {
    float clamped = voltage;
    if(clamped < FURI_HAL_POWER_CHARGE_LIMIT_MIN_V) {
        clamped = FURI_HAL_POWER_CHARGE_LIMIT_MIN_V;
    } else if(clamped > FURI_HAL_POWER_CHARGE_LIMIT_MAX_V) {
        clamped = FURI_HAL_POWER_CHARGE_LIMIT_MAX_V;
    }

    const float steps =
        floorf((clamped - FURI_HAL_POWER_CHARGE_LIMIT_MIN_V) / FURI_HAL_POWER_CHARGE_LIMIT_STEP_V);
    return FURI_HAL_POWER_CHARGE_LIMIT_MIN_V + steps * FURI_HAL_POWER_CHARGE_LIMIT_STEP_V;
}

static uint8_t furi_hal_power_voltage_to_pct(float voltage) {
    if(voltage <= furi_hal_power_curve[0].voltage) {
        return furi_hal_power_curve[0].pct;
    }

    for(size_t i = 1; i < COUNT_OF(furi_hal_power_curve); i++) {
        const FuriHalPowerCurvePoint* previous = &furi_hal_power_curve[i - 1];
        const FuriHalPowerCurvePoint* current = &furi_hal_power_curve[i];
        if(voltage <= current->voltage) {
            const float range = current->voltage - previous->voltage;
            if(range <= 0.0f) {
                return current->pct;
            }

            const float factor = (voltage - previous->voltage) / range;
            return (uint8_t)lroundf(previous->pct + factor * (current->pct - previous->pct));
        }
    }

    return 100;
}

static void furi_hal_power_ensure_initialized(void) {
    if(furi_hal_power.init_attempted) {
        return;
    }

    furi_hal_power.init_attempted = true;
    furi_hal_power.charge_voltage_limit =
        furi_hal_power_quantize_charge_limit(FURI_HAL_POWER_FULL_BATTERY_VOLTAGE_V);

    adc_unit_t adc_unit = ADC_UNIT_1;
    adc_channel_t adc_channel = ADC_CHANNEL_0;
    const esp_err_t map_result =
        adc_oneshot_io_to_channel(gpio_battery_sense.pin, &adc_unit, &adc_channel);
    if(map_result != ESP_OK) {
        ESP_LOGW(TAG, "Unable to map BAT_ADC GPIO%u: %s", gpio_battery_sense.pin, esp_err_to_name(map_result));
        return;
    }

    const adc_oneshot_unit_init_cfg_t init_config = {
        .unit_id = adc_unit,
        .ulp_mode = ADC_ULP_MODE_DISABLE,
    };

    const esp_err_t unit_result =
        adc_oneshot_new_unit(&init_config, &furi_hal_power.adc_handle);
    if(unit_result != ESP_OK) {
        ESP_LOGW(TAG, "Unable to initialize ADC unit: %s", esp_err_to_name(unit_result));
        return;
    }

    const adc_oneshot_chan_cfg_t channel_config = {
        .atten = ADC_ATTEN_DB_12,
        .bitwidth = ADC_BITWIDTH_DEFAULT,
    };

    const esp_err_t channel_result =
        adc_oneshot_config_channel(furi_hal_power.adc_handle, adc_channel, &channel_config);
    if(channel_result != ESP_OK) {
        ESP_LOGW(TAG, "Unable to configure BAT_ADC channel: %s", esp_err_to_name(channel_result));
        return;
    }

    furi_hal_power.adc_unit = adc_unit;
    furi_hal_power.adc_channel = adc_channel;
    furi_hal_power.adc_ready = true;
    furi_hal_power.adc_cali_ready = furi_hal_power_adc_calibration_init(
        adc_unit, adc_channel, channel_config.atten, &furi_hal_power.adc_cali_handle);
    furi_hal_power.initialized = true;
}

static bool furi_hal_power_is_usb_present(void) {
    return furi_hal_power.last_supply_voltage >= FURI_HAL_POWER_USB_PRESENT_THRESHOLD_V;
}

static void furi_hal_power_refresh_sample(void) {
    furi_hal_power_ensure_initialized();
    if(!furi_hal_power.adc_ready) {
        furi_hal_power.last_sample_ok = false;
        return;
    }

    const int64_t now = esp_timer_get_time();
    if((now - furi_hal_power.last_sample_us) < FURI_HAL_POWER_SAMPLE_REFRESH_US &&
       furi_hal_power.last_sample_ok) {
        return;
    }

    int raw_value = 0;
    if(adc_oneshot_read(furi_hal_power.adc_handle, furi_hal_power.adc_channel, &raw_value) != ESP_OK) {
        furi_hal_power.last_sample_ok = false;
        return;
    }

    int pin_mv = 0;
    if(furi_hal_power.adc_cali_ready) {
        if(adc_cali_raw_to_voltage(furi_hal_power.adc_cali_handle, raw_value, &pin_mv) != ESP_OK) {
            furi_hal_power.last_sample_ok = false;
            return;
        }
    } else {
        pin_mv = (raw_value * 3300) / 4095;
    }

