kab7/Flipper-Zero-ESP32-Port/components/furi_hal/furi_hal_power.c
    float supply_voltage = ((float)pin_mv / 1000.0f) * FURI_HAL_POWER_ADC_DIVIDER_RATIO;
    if(supply_voltage < 0.0f) {
        supply_voltage = 0.0f;
    } else if(supply_voltage > 6.0f) {
        supply_voltage = 6.0f;
    }

    furi_hal_power.last_supply_voltage = supply_voltage;
    if(!furi_hal_power_is_usb_present()) {
        furi_hal_power.has_battery_reading = true;
        if(supply_voltage < FURI_HAL_POWER_EMPTY_BATTERY_VOLTAGE_V) {
            furi_hal_power.last_battery_voltage = FURI_HAL_POWER_EMPTY_BATTERY_VOLTAGE_V;
        } else if(supply_voltage > furi_hal_power.charge_voltage_limit) {
            furi_hal_power.last_battery_voltage = furi_hal_power.charge_voltage_limit;
        } else {
            furi_hal_power.last_battery_voltage = supply_voltage;
        }
    }

    furi_hal_power.last_sample_us = now;
    furi_hal_power.last_sample_ok = true;
}

static float furi_hal_power_get_estimated_battery_voltage(void) {
    furi_hal_power_refresh_sample();

    if(!furi_hal_power.last_sample_ok) {
        return 0.0f;
    }

    if(furi_hal_power_is_usb_present()) {
        return furi_hal_power.last_battery_voltage;
    }

    return furi_hal_power.last_supply_voltage;
}

void furi_hal_power_init(void) {
    furi_hal_power_shutdown_diag_init();
    furi_hal_power_ensure_initialized();

#if CONFIG_PM_ENABLE
    /* Dynamic frequency scaling: let the CPU idle at 80 MHz and ramp to 160 MHz
     * only while a peripheral driver (SPI / RMT / I2C ...) or a timing-critical
     * section (insomnia) needs it. This roughly halves idle CPU draw, which is
     * the dominant battery sink on this port. Nothing ever lowered the fixed
     * 160 MHz clock before.
     *
     * DFS 80-160 MHz plus automatic light sleep, the latter gated by the
     * NO_LIGHT_SLEEP lock below. min_freq is 80 (not 40) so APB stays
     * PLL-sourced and the LEDC backlight PWM and I2C timing don't shift. */
    esp_pm_config_t pm_config = {
        .max_freq_mhz = 160,
        .min_freq_mhz = 80,
        .light_sleep_enable = true,
    };
    esp_err_t pm_err = esp_pm_configure(&pm_config);
    if(pm_err != ESP_OK) {
        ESP_LOGW(TAG, "esp_pm_configure failed: %s", esp_err_to_name(pm_err));
    } else {
        esp_err_t lock_err = esp_pm_lock_create(
            ESP_PM_CPU_FREQ_MAX, 0, "insomnia", &furi_hal_power_freq_lock);
        if(lock_err != ESP_OK) {
            ESP_LOGW(TAG, "esp_pm_lock_create failed: %s", esp_err_to_name(lock_err));
            furi_hal_power_freq_lock = NULL;
        }

        /* Create the light-sleep gate and hold it, so nothing sleeps until the
         * idle state (screen off, on battery) explicitly permits it. */
        lock_err = esp_pm_lock_create(
            ESP_PM_NO_LIGHT_SLEEP, 0, "screen_on", &furi_hal_power_no_ls_lock);
        if(lock_err != ESP_OK) {
            furi_hal_power_no_ls_lock = NULL;
        } else {
            esp_pm_lock_acquire(furi_hal_power_no_ls_lock);
        }
#if CONFIG_PM_LIGHT_SLEEP_CALLBACKS
        esp_pm_light_sleep_register_cbs(&furi_hal_power_ls_cbs);
#endif
        ESP_LOGI(TAG, "DFS 80-160 MHz + gated light sleep enabled");
    }
#endif

    /* Initialize shared I2C bus for power ICs (BQ27220 + BQ25896) */
#if defined(BOARD_PIN_QWIIC_SDA) && defined(BOARD_PIN_QWIIC_SCL)
    {
        i2c_config_t conf = {
            .mode = I2C_MODE_MASTER,
            .sda_io_num = BOARD_PIN_QWIIC_SDA,
            .scl_io_num = BOARD_PIN_QWIIC_SCL,
            .sda_pullup_en = GPIO_PULLUP_ENABLE,
            .scl_pullup_en = GPIO_PULLUP_ENABLE,
            .master.clk_speed = 100000,
        };
        i2c_param_config(I2C_NUM_0, &conf);
        esp_err_t i2c_err = i2c_driver_install(I2C_NUM_0, I2C_MODE_MASTER, 0, 0, 0);
        if(i2c_err != ESP_OK && i2c_err != ESP_ERR_INVALID_STATE) {
            ESP_LOGW(TAG, "Power I2C bus init failed: %s", esp_err_to_name(i2c_err));
        }
    }
#endif

    /* Allow power ICs to stabilize after PWR_EN and I2C bus init */
    vTaskDelay(pdMS_TO_TICKS(50));

    /* BQ27220 first (needs clean I2C bus), then BQ25896 */
    furi_hal_bq27220_init();
    furi_hal_bq25896_init();
    furi_hal_power_refresh_sample();
    if(furi_hal_bq27220_is_present()) {
        ESP_LOGI(TAG, "Fuel gauge: BQ27220 (%umV, %u%%)",
            furi_hal_bq27220_get_voltage_mv(), furi_hal_bq27220_get_charge_pct());
    }
    if(furi_hal_bq25896_is_present()) {
        ESP_LOGI(TAG, "Charger: BQ25896 (VBUS=%umV, VREG=%umV)",
            furi_hal_bq25896_get_vbus_voltage_mv(), furi_hal_bq25896_get_vreg_voltage_mv());
    }
}

bool furi_hal_power_gauge_is_ok(void) {
    if(furi_hal_bq27220_is_present()) return true;
    if(!furi_hal_power.adc_handle) return true;
    furi_hal_power_refresh_sample();
    return furi_hal_power.last_sample_ok;
}

bool furi_hal_power_is_shutdown_requested(void) {
    const float battery_voltage = furi_hal_power_get_estimated_battery_voltage();
    return !furi_hal_power_is_usb_present() &&
           (battery_voltage > 0.0f) &&
           (battery_voltage <= FURI_HAL_POWER_LOW_BATTERY_THRESHOLD_V);
}

uint16_t furi_hal_power_insomnia_level(void) {
    return furi_hal_power.insomnia;
}

void furi_hal_power_insomnia_enter(void) {
    FURI_CRITICAL_ENTER();
    furi_check(furi_hal_power.insomnia < UINT8_MAX);
    const bool first = (furi_hal_power.insomnia == 0);
    furi_hal_power.insomnia++;
    FURI_CRITICAL_EXIT();
    /* Acquire outside the critical section (a frequency switch busy-waits for
     * PLL relock). Callers pair enter/exit within the same scope, so the 0->1
     * transition owns exactly one lock reference. */
#if CONFIG_PM_ENABLE
    if(first && furi_hal_power_freq_lock) {
        esp_pm_lock_acquire(furi_hal_power_freq_lock);
    }
#else
    (void)first;
#endif
}

void furi_hal_power_insomnia_exit(void) {
    FURI_CRITICAL_ENTER();
    furi_check(furi_hal_power.insomnia > 0);
    furi_hal_power.insomnia--;
    const bool last = (furi_hal_power.insomnia == 0);
    FURI_CRITICAL_EXIT();
#if CONFIG_PM_ENABLE
    if(last && furi_hal_power_freq_lock) {
        esp_pm_lock_release(furi_hal_power_freq_lock);
    }
#else
    (void)last;
#endif
}

bool furi_hal_power_sleep_available(void) {
    return furi_hal_power.insomnia == 0;
}

