kab7/Flipper-Zero-ESP32-Port/components/furi_hal/furi_hal_power.c
bool furi_hal_power_is_running_on_battery(void) {
    /* Only an explicit VBUS sense is trusted. Without a charger IC we can't
     * tell USB from battery, so assume wired and never light-sleep. */
    return furi_hal_bq25896_is_present() && !furi_hal_bq25896_is_vbus_present();
}

void furi_hal_power_allow_light_sleep(bool allow) {
#if CONFIG_PM_ENABLE
    if(!furi_hal_power_no_ls_lock || allow == furi_hal_power_ls_allowed) return;
    furi_hal_power_ls_allowed = allow;
    if(allow)
        esp_pm_lock_release(furi_hal_power_no_ls_lock);
    else
        esp_pm_lock_acquire(furi_hal_power_no_ls_lock);
#else
    (void)allow;
#endif
}

#if CONFIG_PM_LIGHT_SLEEP_CALLBACKS
void furi_hal_power_get_light_sleep_stats(FuriHalPowerLightSleepStats* out) {
    if(!out) return;
    out->sleep_count = furi_hal_power_ls_count;
    out->total_sleep_us = furi_hal_power_ls_total_us;
    out->wake_timer = furi_hal_power_ls_wake_timer;
    out->wake_gpio = furi_hal_power_ls_wake_gpio;
    out->wake_other = furi_hal_power_ls_wake_other;
    out->allowed = furi_hal_power_ls_allowed;
}
#endif

void furi_hal_power_sleep(void) {
    vTaskDelay(pdMS_TO_TICKS(1));
}

uint8_t furi_hal_power_get_pct(void) {
    /* BQ27220 fuel gauge (T-Embed CC1101) takes priority over ADC */
    if(furi_hal_bq27220_is_present()) {
        return furi_hal_bq27220_get_charge_pct();
    }
    if(!furi_hal_power.adc_handle) {
        return 100; /* No ADC, no fuel gauge → USB powered */
    }
    const float battery_voltage = furi_hal_power_get_estimated_battery_voltage();
    if(battery_voltage <= 0.0f) {
        return 0;
    }

    return furi_hal_power_voltage_to_pct(battery_voltage);
}

uint8_t furi_hal_power_get_bat_health_pct(void) {
    if(furi_hal_bq27220_is_present()) {
        return furi_hal_bq27220_get_health_pct();
    }
    return furi_hal_power_gauge_is_ok() ? 100 : 0;
}

bool furi_hal_power_is_charging(void) {
    /* Prefer BQ25896 charger status (like STM32), fallback to BQ27220 */
    if(furi_hal_bq25896_is_present()) {
        return furi_hal_bq25896_is_charging();
    }
    if(furi_hal_bq27220_is_present()) {
        return furi_hal_bq27220_is_charging();
    }
    furi_hal_power_refresh_sample();
    return furi_hal_power_is_usb_present() && (furi_hal_power.suppress_charge == 0);
}

bool furi_hal_power_is_charging_done(void) {
    if(!furi_hal_power.has_battery_reading) {
        return false;
    }
    return furi_hal_power_is_charging() && (furi_hal_power_get_pct() >= 100);
}

/* Shared teardown before either deep sleep or a real power-off: wait for the
 * button to be released (so we don't immediately re-wake), then kill the
 * display and peripheral power rail. */
static void furi_hal_power_prepare_shutdown(void) {
    /* Wait for button release to avoid immediate wakeup */
    while(gpio_get_level((gpio_num_t)BOARD_PIN_BUTTON_BOOT) == 0) {
        vTaskDelay(pdMS_TO_TICKS(10));
    }
    vTaskDelay(pdMS_TO_TICKS(200)); /* debounce */

#ifdef BOARD_PIN_LCD_BL
    furi_hal_display_set_backlight(0);
#endif
    furi_hal_display_sleep();

    /* Power down peripherals (CC1101 + WS2812) */
#ifdef BOARD_PIN_PWR_EN
    gpio_set_level((gpio_num_t)BOARD_PIN_PWR_EN, 0);
#endif
    power_shutdown_rtc_diag.report.stage = FuriHalPowerShutdownStagePrepared;
}

/* Enter ESP32 deep sleep, waking on the BOOT/encoder button. The RTC domain
 * stays powered (~µA draw); this is not a true power cut. Does not return. */
static void furi_hal_power_enter_deep_sleep(void) {
    /* Wake on the BOOT/encoder button (GPIO0, active low). Keep an RTC-domain
     * pull-up as well as the board's boot-strapping pull-up so EXT0 has a
     * defined HIGH level throughout deep sleep. */
#if SOC_PM_SUPPORT_EXT0_WAKEUP
    rtc_gpio_pulldown_dis((gpio_num_t)BOARD_PIN_BUTTON_BOOT);
    esp_err_t pull_err = rtc_gpio_pullup_en((gpio_num_t)BOARD_PIN_BUTTON_BOOT);
    if(pull_err != ESP_OK) {
        ESP_LOGW(TAG, "BOOT RTC pull-up failed: %s", esp_err_to_name(pull_err));
    }
    esp_err_t wake_err = esp_sleep_enable_ext0_wakeup((gpio_num_t)BOARD_PIN_BUTTON_BOOT, 0);
#else
    esp_err_t wake_err = esp_deep_sleep_enable_gpio_wakeup(
        BIT(BOARD_PIN_BUTTON_BOOT), ESP_GPIO_WAKEUP_GPIO_LOW);
#endif
    power_shutdown_rtc_diag.report.wake_config_error = wake_err;
    power_shutdown_rtc_diag.report.button_level =
        gpio_get_level((gpio_num_t)BOARD_PIN_BUTTON_BOOT);
    power_shutdown_rtc_diag.report.stage = FuriHalPowerShutdownStageWakeConfigured;
    ESP_LOGW(
        TAG,
        "Deep sleep: wake_config=%s BOOT_level=%ld",
        esp_err_to_name(wake_err),
        (long)power_shutdown_rtc_diag.report.button_level);
    /* Keep the T-Embed peripheral rail and backlight OFF while digital GPIOs
     * are otherwise isolated. PowerSrv's stack is now allocated in internal
     * RAM, which ESP-IDF requires when deep-sleep GPIO isolation runs. */
#if SOC_GPIO_SUPPORT_HOLD_IO_IN_DSLP && !SOC_GPIO_SUPPORT_HOLD_SINGLE_IO_IN_DSLP
    gpio_deep_sleep_hold_dis();
#if defined(BOARD_PIN_PWR_EN)
    esp_err_t hold_err = gpio_hold_en((gpio_num_t)BOARD_PIN_PWR_EN);
    if(hold_err != ESP_OK) {
        ESP_LOGW(TAG, "PWR_EN hold failed: %s", esp_err_to_name(hold_err));
    }
#if defined(BOARD_PIN_LCD_BL)
    if(BOARD_PIN_LCD_BL < GPIO_NUM_MAX) {
        hold_err = gpio_hold_en((gpio_num_t)BOARD_PIN_LCD_BL);
        if(hold_err != ESP_OK) {
            ESP_LOGW(TAG, "LCD_BL hold failed: %s", esp_err_to_name(hold_err));
        }
    }
#endif
    gpio_deep_sleep_hold_en();
#endif
#endif
    power_shutdown_rtc_diag.report.stage = FuriHalPowerShutdownStageEnteringDeepSleep;
    esp_deep_sleep_start();
}

/* Deep-sleep power-off (default mode). */
void furi_hal_power_shutdown(void) {
    furi_hal_power_shutdown_diag_begin(FuriHalPowerShutdownModeDeepSleep);
    furi_hal_power_prepare_shutdown();
    furi_hal_power_enter_deep_sleep();
}

/* Real power-off: put the BQ25896 charger into ship mode (BATFET off), which
 * physically disconnects the battery -> 0 draw, wakes only via USB plug or the
 * charger's /QON button. Only possible on battery: with USB attached the
 * charger keeps SYS powered, so we fall back to deep sleep. If there is no
 * charger at all (or the write fails) we also fall back to deep sleep. */
void furi_hal_power_off(void) {
    furi_hal_power_shutdown_diag_begin(FuriHalPowerShutdownModePowerOff);
    furi_hal_power_prepare_shutdown();

    bool charger_present = furi_hal_bq25896_is_present();
    power_shutdown_rtc_diag.report.charger_present = charger_present;
    power_shutdown_rtc_diag.report.stage = FuriHalPowerShutdownStageChargerCheck;
    if(charger_present) {
        bool vbus_present = furi_hal_bq25896_is_vbus_present();
        power_shutdown_rtc_diag.report.vbus_present = vbus_present;
        ESP_LOGW(TAG, "Power off: charger=1 VBUS=%d", vbus_present);
        if(!vbus_present) {
            power_shutdown_rtc_diag.report.stage = FuriHalPowerShutdownStageShipCommand;
            bool ship_write_ok = furi_hal_bq25896_poweroff();
            power_shutdown_rtc_diag.report.ship_write_ok = ship_write_ok;
            power_shutdown_rtc_diag.report.stage = FuriHalPowerShutdownStageShipReturned;
            ESP_LOGW(TAG, "Ship command returned: I2C_ok=%d", ship_write_ok);
            /* BATFET cut is near-instant; give it a moment. Should not return. */
            vTaskDelay(pdMS_TO_TICKS(500));
        }
    } else {
        ESP_LOGW(TAG, "Power off: BQ25896 not detected; using deep sleep");
    }

    /* Fallback: on USB, no battery path, or BATFET failed -> deep sleep. */
    furi_hal_power_enter_deep_sleep();
}

